tests/src/serviceTest/resources/request/contratsTP/soapContrat/request5660_droitsNonOuverts.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    <soap:Body>
        <ns5:getInfoBddRequest xmlns="http://norme.cegedimassurances.com/commun" xmlns:ns2="http://norme.cegedimassurances.com/base_de_droit" xmlns:ns3="http://norme.cegedimassurances.com/beneficiaire" xmlns:ns4="http://norme.cegedimassurances.com/amc" xmlns:ns5="http://ws.cegedimassurance.com/basededroit/wsdl">
            <ns2:header_in>
                <headerTech>
                    <id_logiciel_client>urn:cnda:00000000</id_logiciel_client>
                    <version_logiciel_client>1</version_logiciel_client>
                    <id_session_client>UUID070-IDB-21019-0020-CEGEDIM</id_session_client>
                </headerTech>
                <headerFonc>
                    <code_contexte>CD-01</code_contexte>
                    <code_proprietaire>00511719</code_proprietaire>
                </headerFonc>
            </ns2:header_in>
            <ns2:beneficiaire>
                <ns3:NIR_certifie>1791062498046</ns3:NIR_certifie>
                <ns3:cle_NIR>46</ns3:cle_NIR>
                <ns3:date_naissance>19791006</ns3:date_naissance>
                <ns3:rang_gemellaire>1</ns3:rang_gemellaire>
            </ns2:beneficiaire>
            <ns2:amc>
                <ns4:adherent>54582311001</ns4:adherent>
                <ns4:numero_AMC_prefectoral>0000401166</ns4:numero_AMC_prefectoral>
            </ns2:amc>
            <ns2:info_bdd>
                <ns2:type_garanties>1</ns2:type_garanties>
                <ns2:type_recherche_benef>0</ns2:type_recherche_benef>
                <ns2:type_recherche_segment>3</ns2:type_recherche_segment>
                <ns2:liste_segment_recherche>
                    <ns2:segment_recherche>CSTE</ns2:segment_recherche>
                </ns2:liste_segment_recherche>
                <ns2:type_profondeur_recherche>0</ns2:type_profondeur_recherche>
            </ns2:info_bdd>
            <ns2:dates>
                <date_reference>2022-12-25</date_reference>
                <type_date_reference>1</type_date_reference>
                <date_debut>2022-12-25</date_debut>
                <date_fin>2022-12-25</date_fin>
            </ns2:dates>
        </ns5:getInfoBddRequest>
    </soap:Body>
</soap:Envelope>
